#### DWFImageQuality Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible image quality for DWF Export.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum DWFImageQuality ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DWFImageQuality ``` |

| Visual C++ |
| --- |
| ``` public enum class DWFImageQuality ``` |

# Members

| Member name | Description |
| --- | --- |
| Default |  |
| Low |  |
| Medium |  |
| High |  |

# See Also

Autodesk.Revit.DB Namespace